Autodesk.AutoCAD.GraphicsSystem.Manager2
The Manager2 class extends the functionality of the Manager class and provides services that help to hide the details of connecting AutoCAD and ARX applications to the graphics system (GS).

Autodesk.AutoCAD.GraphicsSystem.Manager2.GetActiveModels(Autodesk.AutoCAD.DatabaseServices.Database)
Gets an array of active "main" graphics models for a database.
db:  Input database

Autodesk.AutoCAD.GraphicsSystem.Manager2.ActiveGraphicsKernels
Gets an array of active graphics kernels.

Autodesk.AutoCAD.GraphicsSystem.Manager2.ActiveModels
Gets an array of active graphics models.