Autodesk.AutoCAD.EditorInput.Editor.SelectCrossingWindow(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.EditorInput.SelectionFilter,System.Boolean)
This is SelectCrossingWindow, a member of class Editor.

Autodesk.AutoCAD.EditorInput.Editor.SelectImplied
Selects the firstpick set.

Autodesk.AutoCAD.EditorInput.Editor.GetKeywords(Autodesk.AutoCAD.EditorInput.PromptKeywordOptions)
Gets user input for a keyword.
options:  Input optional parameters of the prompt.

Autodesk.AutoCAD.EditorInput.Editor.SetImpliedSelection(Autodesk.AutoCAD.EditorInput.SelectionSet)
This is SetImpliedSelection, a member of class Editor.

Autodesk.AutoCAD.EditorInput.Editor.SetImpliedSelection(Autodesk.AutoCAD.DatabaseServices.ObjectId[])
This is SetImpliedSelection, a member of class Editor.