Autodesk.AutoCAD.DatabaseServices.AssocPersSubentityIdPE.GetEdgeVertexSubentities(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.SubentityId,Autodesk.AutoCAD.DatabaseServices.SubentityId&amp;,Autodesk.AutoCAD.DatabaseServices.SubentityId&amp;,Autodesk.AutoCAD.DatabaseServices.SubentityId[]&amp;)
Gets the vertex SubentityIds corresponding to the given edge SubentityId.
entity:  The entity must be open for read.
edgeSubentId:  Edge SubentityId whose vertex SubentityIds are to be obtained.
startVertexSubentId:  Returned SubentityId of the start vertex of the edge (or NullSubentityId if there is not any).
endVertexSubentId:  Returned SubentityId of the end vertex of the edge (or NullSubentityId if there is not any).
otherVertexSubentIds:  Returned other SubentityIds associated with the edge, such as the circle or arc center, spline control and fit points, etc.

Autodesk.AutoCAD.DatabaseServices.AssocPersSubentityIdPE.GetSplineEdgeVertexSubentities(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.SubentityId,Autodesk.AutoCAD.DatabaseServices.SubentityId&amp;,Autodesk.AutoCAD.DatabaseServices.SubentityId&amp;,Autodesk.AutoCAD.DatabaseServices.SubentityId[]&amp;,Autodesk.AutoCAD.DatabaseServices.SubentityId[]&amp;)
Gets the vertex SubentityIds corresponding to the given edge SubentityId whose geometry is defined by a spline.
entity:  The entity must be open for read.
edgeSubentId:  Edge SubentId whose vertex SubentityIds are to be obtained.
startVertexSubentId:  Returned SubentityId of the start vertex of the edge (or NullSubentityId if there is not any).
endVertexSubentId:  Returned SubentityId of the end vertex of the edge (or NullSubentityId if there is not any).
controlPointSubentIds:  Returned SubentityIds identifying the spline control points. The order is the same as the order of the spline control points.
fitPointSubentIds:  Returned SubentityIds identifying the spline fit points (if any). The order is the same as the order of the spline fit points.