Autodesk.AutoCAD.LayerManager.LayerFilter.FilterExpression
Returns a filter expression of this form: /*
BNF for the valid boolean expression we evaluate
<bool_expr>.= <bool_expr> or <and_expr> | <and_expr>
<and_expr>.=<and_expr> and <rel_expr> | <rel_expr>
<rel_expr>.=<variable><rel_op><constant>
<rel_op>.= == | !=
<constant>.=A-Z0-9*?~@.,-
<variable>.=#A-Z0-9
*/
This function may return null if the filter cannot be described this way.