Autodesk.AutoCAD.DatabaseServices.XrefObjectId.Deserialize(Autodesk.AutoCAD.DatabaseServices.ResultBuffer,Autodesk.AutoCAD.DatabaseServices.ResultBuffer&amp;)
Turns the sequence of data between rbStart and rbEnd back into this object.
rbStart:  Input Autodesk.AutoCAD.DatabaseServices.ResultBuffer object.
rbEnd:  Input Autodesk.AutoCAD.DatabaseServices.ResultBuffer object.