Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBody.CreateAndPostToDatabase(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.ObjectId&amp;,Autodesk.AutoCAD.DatabaseServices.ObjectId&amp;)
"Pseudo constructor".
dimId:  ObjectId of the Dimension.
dimDepId:  ObjectId of the created AssocDependency.
dimDepBodyId:  ObjectId of the created AssocDimDependencyBody.