Autodesk.AutoCAD.DatabaseServices.Table.IsMergedCell(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.CellRange&amp;)
Obsolete. Returns true if the specified cell is within merged cells.
row:  Input specifying the zero-based row index for the cell
col:  Input specifying the zero-based column index for the cell
range:  Output the range of merged cells