Autodesk.AutoCAD.DatabaseServices.AssocSweptSurfaceActionBody.GetScaleFactor(System.String&amp;,System.String&amp;)
This wraps the ObjectARX AcDbAssocSweptSurfaceActionBody::scaleFactor() method.

Autodesk.AutoCAD.DatabaseServices.AssocSweptSurfaceActionBody.GetAlignAngle(System.String&amp;,System.String&amp;)
This wraps the ObjectARX AcDbAssocSweptSurfaceActionBody::alignAngle() method.

Autodesk.AutoCAD.DatabaseServices.AssocSweptSurfaceActionBody.GetTwistAngle(System.String&amp;,System.String&amp;)
This wraps the ObjectARX AcDbAssocSweptSurfaceActionBody::twistAngle() method.