Autodesk.AutoCAD.DatabaseServices.AssocArrayCommonParameters.GetRowCount(System.String&amp;,System.String&amp;)
This wraps the ObjectARX AcDbAssocArrayCommonParameters::rowCount() method.

Autodesk.AutoCAD.DatabaseServices.AssocArrayCommonParameters.GetRowSpacing(System.String&amp;,System.String&amp;)
This wraps the ObjectARX AcDbAssocArrayCommonParameters::rowSpacing() method.

Autodesk.AutoCAD.DatabaseServices.AssocArrayCommonParameters.GetRowElevation(System.String&amp;,System.String&amp;)
This wraps the ObjectARX AcDbAssocArrayCommonParameters::rowElevation() method.

Autodesk.AutoCAD.DatabaseServices.AssocArrayCommonParameters.GetLevelCount(System.String&amp;,System.String&amp;)
This wraps the ObjectARX ObjectARX AcDbAssocArrayCommonParameters::levelCount() method.

Autodesk.AutoCAD.DatabaseServices.AssocArrayCommonParameters.GetLevelSpacing(System.String&amp;,System.String&amp;)
This wraps the ObjectARX AcDbAssocArrayCommonParameters::levelSpacing() method.