Autodesk.AutoCAD.DatabaseServices.RasterImageDef.GetEntityCount(System.Boolean&amp;)
Returns the number of RasterImage entities in the current drawing that are dependent upon this object for display graphics.
locked:  Input locked value