Autodesk.AutoCAD.DatabaseServices.AssocVariable.ValidateNameAndExpression(System.String,System.String,System.String&amp;)
Validates the given nameToValidate, expressionToValidate or both, to see whether they can be used as name and/or expression for this variable.
nameToValidate:  The variable name to validate. May be null.
expressionToValidate:  The variable expression to validate. May be null.
errorMessage:  Error string if the name or expression is not valid, empty otherwise.

Autodesk.AutoCAD.DatabaseServices.AssocVariable.EvaluateExpression(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection&amp;,Autodesk.AutoCAD.DatabaseServices.ResultBuffer[]&amp;,Autodesk.AutoCAD.DatabaseServices.ResultBuffer&amp;)
A helper method allowing to evaluate the expression at any time without modifying the variable and by explicitly providing values of the referenced objects (variables).
objectIds:  Array of ids of value-providing objects. It is an in/out argument. It is being appended during the evaluation with ids of the value-providing objects whose values have been obtained (currently these objects are only AssocVariables).
objectValues:  Array of values of value-providing objects. It is an in/out argument. It is being appended during the evaluation with values of the value-providing objects whose values have been obtained (currently these objects are only AssocVariables).
evaluatedExpressionValue:  Returned evaluated value of the expression.

Autodesk.AutoCAD.DatabaseServices.AssocVariable.EvaluateExpression(Autodesk.AutoCAD.DatabaseServices.ResultBuffer&amp;)
A helper method allowing the expression to evaluated at any time without modifying the variable.
evaluatedExpressionValue:  Returned evaluated value of the expression.