Autodesk.AutoCAD.DatabaseServices.AssocBlendSurfaceActionBody.GetStartEdgeContinuity(System.String&amp;,System.String&amp;)
This wraps the ObjectARX AcDbAssocBlendSurfaceActionBody::startEdgeContinuity() method.

Autodesk.AutoCAD.DatabaseServices.AssocBlendSurfaceActionBody.GetEndEdgeContinuity(System.String&amp;,System.String&amp;)
This wraps the ObjectARX AcDbAssocBlendSurfaceActionBody::endEdgeContinuity() method.

Autodesk.AutoCAD.DatabaseServices.AssocBlendSurfaceActionBody.GetStartEdgeBulge(System.String&amp;,System.String&amp;)
This wraps the ObjectARX AcDbAssocBlendSurfaceActionBody::startEdgeBulge() method.

Autodesk.AutoCAD.DatabaseServices.AssocBlendSurfaceActionBody.GetEndEdgeBulge(System.String&amp;,System.String&amp;)
This wraps the ObjectARX AcDbAssocBlendSurfaceActionBody::endEdgeBulge() method.

Autodesk.AutoCAD.DatabaseServices.AssocBlendSurfaceActionBody.GetContinuityGripPoints(Autodesk.AutoCAD.Geometry.Point3d&amp;,Autodesk.AutoCAD.Geometry.Point3d&amp;)
This wraps the ObjectARX AcDbAssocBlendSurfaceActionBody::getContinuityGripPoints() method.

Autodesk.AutoCAD.DatabaseServices.AssocBlendSurfaceActionBody.GetProfiles(Autodesk.AutoCAD.DatabaseServices.LoftProfile&amp;,Autodesk.AutoCAD.DatabaseServices.LoftProfile&amp;)
This wraps the ObjectARX AcDbAssocBlendSurfaceActionBody::getProfiles() method.