Autodesk.AutoCAD.DatabaseServices.Region.AreaProperties(Autodesk.AutoCAD.Geometry.Point3d&amp;,Autodesk.AutoCAD.Geometry.Vector3d&amp;,Autodesk.AutoCAD.Geometry.Vector3d&amp;)
This function calculates the area properties of the Region.
origin:  Input point (in WCS coords) for origin of the coordinate system to usefor evaluation.
xAxis:  Input X axis (in WCS coords) of the coordinate system to use forevaluation.
yAxis:  Input Y axis (in WCS coords) of the coordinate system to use forevaluation.