Autodesk.AutoCAD.DatabaseServices.Section.GenerateSectionGeometry(Autodesk.AutoCAD.DatabaseServices.Entity,System.Array&amp;,System.Array&amp;,System.Array&amp;,System.Array&amp;,System.Array&amp;)
This function generates 2D or 3D section geometry.
pEnt:  Input sectionable entity
pIntFillEnts:  Return array containing intersection boundary geometry
pBackgroundEnts:  Return array containing intersection fill annotation geometry
pForegroundEnts:  Return array containing background geometry
pFurveTangencyEnts:  Return array containing foreground geometry
pCurveTangencyEnts:  Return array containing curve tangency geometry