Autodesk.AutoCAD.DatabaseServices.AssocNetworkSurfaceActionBody.GetContinuity(Autodesk.AutoCAD.DatabaseServices.AssocLoftedSurfaceActionBody.ProfileType,System.String&amp;,System.String&amp;)
This wraps the ObjectARXAcDbAssocNetworkSurfaceActionBody::getContinuity() method.

Autodesk.AutoCAD.DatabaseServices.AssocNetworkSurfaceActionBody.GetBulge(Autodesk.AutoCAD.DatabaseServices.AssocLoftedSurfaceActionBody.ProfileType,System.String&amp;,System.String&amp;)
This wraps the ObjectARX AcDbAssocNetworkSurfaceActionBody::getBulge() method.