Autodesk.AutoCAD.DatabaseServices.EqualHelpParameterConstraint.GetEqualHelpParameters(Autodesk.AutoCAD.DatabaseServices.HelpParameter&amp;,Autodesk.AutoCAD.DatabaseServices.HelpParameter&amp;)
Returns pointers to the two HelpParameter objects which this constraint is connected to.
pHelpParameter1:  The returned pointer to the first AcHelpParameter object.
pHelpParameter2:  The returned pointer to the second AcHelpParameter object.