Autodesk.AutoCAD.DatabaseServices.Database.DxfOut(System.String,System.Int32,Autodesk.AutoCAD.DatabaseServices.DwgVersion)
This function creates an DXF file.
fileName:  Input name or URL of the new DXF file to create (the .dxf extension is not added automatically)
precision:  Input number of bits of accuracy, from 0 to 16
version:  Sets the DWG version major and minor number

Autodesk.AutoCAD.DatabaseServices.Database.DxfOut(System.String,System.Int32,System.Boolean)
This function creates an DXF file.
Note
The precision may also be set to -1 to change the output format from the default ASCII DXF format to the binary DXF format.
fileName:  Input name or URL of the new DXF file to create (the .dxf extension is not added automatically)
precision:  Input number of bits of accuracy, from 0 to 16
saveThumbnailImage:  Input Boolean indicating whether to save thumbnail