Autodesk.AutoCAD.DatabaseServices.NurbSurface.Evaluate(System.Double,System.Double,System.Int32,Autodesk.AutoCAD.Geometry.Point3d&amp;,Autodesk.AutoCAD.Geometry.Vector3dCollection&amp;)
This wraps the ObjectARX evaluate(double u, double v, int derivDegree, AcGePoint3d& point, AcGeVector3dArray& derivatives) method.

Autodesk.AutoCAD.DatabaseServices.NurbSurface.Evaluate(System.Double,System.Double,Autodesk.AutoCAD.Geometry.Point3d&amp;,Autodesk.AutoCAD.Geometry.Vector3d&amp;,Autodesk.AutoCAD.Geometry.Vector3d&amp;,Autodesk.AutoCAD.Geometry.Vector3d&amp;,Autodesk.AutoCAD.Geometry.Vector3d&amp;,Autodesk.AutoCAD.Geometry.Vector3d&amp;)
This wraps the ObjectARX evaluate(double u, double v, AcGePoint3d& pos, AcGeVector3d& uDeriv, AcGeVector3d& vDeriv, AcGeVector3d& uuDeriv, AcGeVector3d& uvDeriv, AcGeVector3d& vvDeriv) method.

Autodesk.AutoCAD.DatabaseServices.NurbSurface.Evaluate(System.Double,System.Double,Autodesk.AutoCAD.Geometry.Point3d&amp;,Autodesk.AutoCAD.Geometry.Vector3d&amp;,Autodesk.AutoCAD.Geometry.Vector3d&amp;)
This wraps the ObjectARX evaluate(double u, double v, AcGePoint3d& pos, AcGeVector3d& uDeriv, AcGeVector3d& vDeriv) method.

Autodesk.AutoCAD.DatabaseServices.NurbSurface.IsPlanar(Autodesk.AutoCAD.Geometry.Point3d&amp;,Autodesk.AutoCAD.Geometry.Vector3d&amp;)
This wraps the ObjectARX AcDbNurbSurface::isPlanar() method.

Autodesk.AutoCAD.DatabaseServices.NurbSurface.GetParameterOfPoint(Autodesk.AutoCAD.Geometry.Point3d,System.Double&amp;,System.Double&amp;)
This wraps the ObjectARX AcDbNurbSurface::getParameterOfPoint() method.