Autodesk.AutoCAD.DatabaseServices.AssocActionBody.EvaluationPriorityOverride(Autodesk.AutoCAD.DatabaseServices.AssocEvaluationPriority&amp;)
Called from the corresponding method of the parent AssocAction class that owns this action body object.

Autodesk.AutoCAD.DatabaseServices.AssocActionBody.AddParam(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Int32&amp;)
This wraps the ObjectARX AcDbAssocParamBasedActionBody::addParam () method.