Autodesk.AutoCAD.DatabaseServices.AutoConstrainEvaluationCallback.GetTotalConstraints(Autodesk.AutoCAD.DatabaseServices.GeometricalConstraint[]&amp;)
Returns a list of constraints found by autoconstraint evaluation.
constraints:  reference to array of constraints, to return list of constraints found by autoconstraint evaluation. This parameter can be null if caller doesn't want list of constraints.