Autodesk.AutoCAD.DatabaseServices.AssocEdgeChamferActionBody.GetBaseDistance(System.String&amp;,System.String&amp;)
This wraps the ObjectARX AcDbAssocEdgeChamferActionBody::baseDistance() method.

Autodesk.AutoCAD.DatabaseServices.AssocEdgeChamferActionBody.GetOtherDistance(System.String&amp;,System.String&amp;)
This wraps the ObjectARX AcDbAssocEdgeChamferActionBody::otherDistance() method.