Autodesk.AutoCAD.DatabaseServices.AssocArrayRectangularParameters.GetColumnCount(System.String&amp;,System.String&amp;)
Wraps the ObjectARX AcDbAssocArrayRectangularParameters::columnCount() method.

Autodesk.AutoCAD.DatabaseServices.AssocArrayRectangularParameters.GetColumnSpacing(System.String&amp;,System.String&amp;)
Wraps the ObjectARX AcDbAssocArrayRectangularParameters::columnSpacing() method.

Autodesk.AutoCAD.DatabaseServices.AssocArrayRectangularParameters.GetAxesAngle(System.String&amp;,System.String&amp;)
Wraps the ObjectARX AcDbAssocArrayRectangularParameters::axesAngle() method.