Autodesk.AutoCAD.DatabaseServices.Surface.RayTest(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double,Autodesk.AutoCAD.DatabaseServices.SubentityId[]&amp;,Autodesk.AutoCAD.Geometry.DoubleCollection&amp;)
This wraps the ObjectARX AcDbSurface::rayTest() method.