Autodesk.AutoCAD.DatabaseServices.PointCloudColorMap.ColorScheme(System.String,Autodesk.AutoCAD.DatabaseServices.PointCloudColorRamp&amp;)
This is ColorScheme, a member of class PointCloudColorMap.

Autodesk.AutoCAD.DatabaseServices.PointCloudColorMap.ClassificationScheme(System.String,Autodesk.AutoCAD.DatabaseServices.PointCloudClassificationColorRamp&amp;)
This is ClassificationScheme, a member of class PointCloudColorMap.