Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBodyBase.GetVariableNameAndExpression(System.String&amp;,System.String&amp;,System.String)
Returns name, expression and current value of the AssocVariable that corresponds to this dimensional constraint.
name:  Variable name.
expression:  Variable expression.
value:  Variable value.

Autodesk.AutoCAD.DatabaseServices.AssocDimDependencyBodyBase.GetEntityNameAndExpression(System.String&amp;,System.String&amp;)
Returns name and expression from the text that the managed entity is displaying.
name:  Name from the managed entity display text.
expression:  Expression from the managed entity display text.