Autodesk.AutoCAD.DatabaseServices.MultiModesGripPE.GetGripModes(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.GripData,Autodesk.AutoCAD.DatabaseServices.GripModeCollection,System.UInt32&amp;)
Queries an object, on a given grip point, for the available modes it provides.
entity:  The Entity whose modes are requested. The object needs to be open at least for read.
gripData:  The grip whose modes are requested.
modes:  The returned collection of available modes.
curMode:  The returned identifier of current mode.