Autodesk.AutoCAD.Geometry.Curve3d.IsOn(Autodesk.AutoCAD.Geometry.Point3d,System.Double&amp;)
Determines if the point lies on curve.
point:  Input any 3D point
value:  Input parameter value of point if point lies on curve

Autodesk.AutoCAD.Geometry.Curve3d.IsOn(Autodesk.AutoCAD.Geometry.Point3d,System.Double&amp;,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if point lies on curve.
point:  Input any 3D point
value:  Input parameter value of point if point lies on curve
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Curve3d.IsPlanar(Autodesk.AutoCAD.Geometry.Plane&amp;)
Determines if curve is planar.
plane:  Input plane on which this curve lies if it is planar

Autodesk.AutoCAD.Geometry.Curve3d.IsPlanar(Autodesk.AutoCAD.Geometry.Plane&amp;,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if curve is planar.
plane:  Input plane on which this curve lies if it is planar
tolerance:  EvaluatePoint

Autodesk.AutoCAD.Geometry.Curve3d.IsLinear(Autodesk.AutoCAD.Geometry.Line3d&amp;)
Determines if curve is linear.
line:  Input line on which this curve lies if it is linear

Autodesk.AutoCAD.Geometry.Curve3d.IsLinear(Autodesk.AutoCAD.Geometry.Line3d&amp;,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if curve is linear.
line:  Input line on which this curve lies if it is linear
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Curve3d.IsCoplanarWith(Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Plane&amp;)
Returns true if both curve are planar and lie in the same plane.
curve3d:  Input any 3D curve
plane:  Input plane in which this curve and input curve lie

Autodesk.AutoCAD.Geometry.Curve3d.IsCoplanarWith(Autodesk.AutoCAD.Geometry.Curve3d,Autodesk.AutoCAD.Geometry.Plane&amp;,Autodesk.AutoCAD.Geometry.Tolerance)
Returns true if both curve are planar and lie in the same plane.
curve3d:  Input any 3D curve
plane:  Input plane in which this curve and input curve lie
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Curve3d.IsPeriodic(System.Double&amp;)
Determines if the curve is periodic.
period:  Input period of curve parameter

Autodesk.AutoCAD.Geometry.Curve3d.IsDegenerate(Autodesk.AutoCAD.Geometry.Entity3d&amp;)
Determines if the curve is degenerate and if so returns the entity which the curve degenerates into.
result:  Output type of degenerate entity

Autodesk.AutoCAD.Geometry.Curve3d.IsDegenerate(Autodesk.AutoCAD.Geometry.Entity3d&amp;,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if the curve is degenerate and if so returns the entity which the curve degenerates into.
result:  Output type of degenerate entity
tolerance:  Input tolerance value