Autodesk.AutoCAD.DatabaseServices.AssocExtrudedSurfaceActionBody.GetTaperAngle(System.String&amp;,System.String&amp;)
This wraps the ObjectARX AcDbAssocExtrudedSurfaceActionBody::taperAngle() method.

Autodesk.AutoCAD.DatabaseServices.AssocExtrudedSurfaceActionBody.GetHeight(System.String&amp;,System.String&amp;)
This wraps the ObjectARX AcDbAssocExtrudedSurfaceActionBody::height() method.