Autodesk.AutoCAD.Runtime.Dictionary.AtPut(System.String,Autodesk.AutoCAD.Runtime.RXObject,System.Int32&amp;)
Puts value into the dictionary with key as the lookup key and returns the new entry's dictionary ID in retId for future searches for this object using retId instead of the key.
key:  Input lookup key string to use.
value:  Input object to add to the dictionary.
retId:  Output dictionary entry ID for the newly entered value.