Autodesk.AutoCAD.DatabaseServices.AssocRevolvedSurfaceActionBody.GetRevolveAngle(System.String&amp;,System.String&amp;)
This wraps the ObjectARX AcDbAssocRevolvedSurfaceActionBody::revolveAngle() method.