Autodesk.AutoCAD.DatabaseServices.AssocFilletSurfaceActionBody.GetRadius(System.String&amp;,System.String&amp;)
This wraps the ObjectARX AcDbAssocFilletSurfaceActionBody::radius() method.

Autodesk.AutoCAD.DatabaseServices.AssocFilletSurfaceActionBody.GetFilletHandleData(Autodesk.AutoCAD.Geometry.Point3d&amp;,Autodesk.AutoCAD.Geometry.Vector3d&amp;,Autodesk.AutoCAD.Geometry.Point3d&amp;,Autodesk.AutoCAD.Geometry.Vector3d&amp;)
This wraps the ObjectARX AcDbAssocFilletSurfaceActionBody::getFilletHandleData() method.