Autodesk.AutoCAD.DatabaseServices.AssocPatchSurfaceActionBody.GetContinuity(System.String&amp;,System.String&amp;)
This wraps the ObjectARX AcDbAssocPatchSurfaceActionBody::continuity() method.

Autodesk.AutoCAD.DatabaseServices.AssocPatchSurfaceActionBody.GetBulge(System.String&amp;,System.String&amp;)
This wraps the ObjectARX AcDbAssocPatchSurfaceActionBody::bulge() method.