Autodesk.AutoCAD.DatabaseServices.AssocPersSubentityId.CreateObjectAndDwgInFields(Autodesk.AutoCAD.DatabaseServices.Database,Autodesk.AutoCAD.DatabaseServices.DwgFiler,Autodesk.AutoCAD.DatabaseServices.AssocPersSubentityId&amp;)
A static method that reads the class identification of the actual AssocPersSubentityId-derived class, creates an object of this derived class and calls DwgInFields() on it.
database:  AcDbDatabase that is going to own the AcDbAssocPersSubentId.
filer:  The filer to read the data from. The first data is the class identification.
createdPersSubentId:  This is an in/out argument used to return the created and filled-in object of an AssocPersSubentityId-derived class. If the createdPersSubentId is passed in as not NULL, the code tries to reuse the existing object, if it is of the expected derived class. If it is passed in as NULL or is not of the expected derived type, it creates a new object (deleting the existing one, if any).

Autodesk.AutoCAD.DatabaseServices.AssocPersSubentityId.CreateObjectAndDxfInFields(Autodesk.AutoCAD.DatabaseServices.DxfFiler,Autodesk.AutoCAD.DatabaseServices.AssocPersSubentityId&amp;)
A static method that reads the class identification of the actual AssocPersSubentityId-derived class, creates an object of this derived class and calls DxfInFields() on it.
filer:  The filer to read the data from. The first data is the class identification.
createdPersSubentId:  This is an in/out argument used to return the created and filled-in object of an AssocPersSubentityId-derived class. If the createdPersSubentId is passed in as not NULL, the code tries to reuse the existing object, if it is of the expected derived class. If it is passed in as NULL or is not of the expected derived type, it creates a new object (deleting the existing one, if any).