Autodesk.AutoCAD.DatabaseServices.AssocArrayPathParameters.GetItemCount(System.String&amp;,System.String&amp;)
Wraps the ObjectARX AcDbAssocArrayPathParameters::itemCount() method.

Autodesk.AutoCAD.DatabaseServices.AssocArrayPathParameters.GetItemSpacing(System.String&amp;,System.String&amp;)
Wraps the ObjectARX AcDbAssocArrayPathParameters::itemSpacing() method.

Autodesk.AutoCAD.DatabaseServices.AssocArrayPathParameters.GetStartOffset(System.String&amp;,System.String&amp;)
Wraps the ObjectARX AcDbAssocArrayPathParameters::startOffset() method.

Autodesk.AutoCAD.DatabaseServices.AssocArrayPathParameters.GetEndOffset(System.String&amp;,System.String&amp;)
Wraps the ObjectARX the ObjectARX AcDbAssocArrayPathParameters::endOffset() method.