Autodesk.AutoCAD.Geometry.KnotCollection.GetInterval(System.Int32,System.Double,Autodesk.AutoCAD.Geometry.Interval&amp;)
Returns the non-zero length intervals between knots.
order:  Input order of a spline
parameter:  Input parameter
interval:  Output containing knot interval