Autodesk.AutoCAD.Geometry.Curve2d.IsOn(Autodesk.AutoCAD.Geometry.Point2d,System.Double&amp;)
Determines if input point lies on curve.
point:  Input any 2D point
value:  Output parameter value of point if point lies on curve

Autodesk.AutoCAD.Geometry.Curve2d.IsOn(Autodesk.AutoCAD.Geometry.Point2d,System.Double&amp;,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if point lies on curve.
point:  Input any 2D point
value:  Output parameter value of point if point lies on curve
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Curve2d.IsPeriodic(System.Double&amp;)
Determines if the curve is periodic.
period:  Input period of curve parameter

Autodesk.AutoCAD.Geometry.Curve2d.IsLinear(Autodesk.AutoCAD.Geometry.Line2d&amp;)
Determines if curve is linear.
line:  Output line on which this curve lies if it is linear

Autodesk.AutoCAD.Geometry.Curve2d.IsLinear(Autodesk.AutoCAD.Geometry.Line2d&amp;,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if curve is linear.
line:  Output line on which this curve lies if it is linear
tolerance:  Input tolerance value

Autodesk.AutoCAD.Geometry.Curve2d.IsDegenerate(Autodesk.AutoCAD.Geometry.Entity2d&amp;)
Determines if the curve is degenerate.
result:  Output type of degenerate entity

Autodesk.AutoCAD.Geometry.Curve2d.IsDegenerate(Autodesk.AutoCAD.Geometry.Entity2d&amp;,Autodesk.AutoCAD.Geometry.Tolerance)
Determines if the curve is degenerate with a tolerance.
result:  Output type of degenerate entity
tolerance:  Input tolerance value