Autodesk.AutoCAD.DatabaseServices.Viewport.GetUcs(Autodesk.AutoCAD.Geometry.Point3d&amp;,Autodesk.AutoCAD.Geometry.Vector3d&amp;,Autodesk.AutoCAD.Geometry.Vector3d&amp;)
This function returns the origin, x-axis, and y-axis of the ucs for this viewport.
origin:  Input origin
: Input x-axis
y:  Input y-axis