Autodesk.AutoCAD.Geometry.Interval.IsPeriodicallyOn(System.Double,System.Double&amp;)
Returns true if there exists an integer N such that this interval contains the value val + N * period.
period:  Input period length
value:  Output System.Double object; Output value, if True