Autodesk.AutoCAD.DatabaseServices.AssocArrayPolarParameters.GetItemCount(System.String&amp;,System.String&amp;)
Wraps the ObjectARX AcDbAssocArrayPolarParameters::itemCount() method.

Autodesk.AutoCAD.DatabaseServices.AssocArrayPolarParameters.GetAngleBetweenItems(System.String&amp;,System.String&amp;)
Wraps the ObjectARX AcDbAssocArrayPolarParameters::angleBetweenItems() method.

Autodesk.AutoCAD.DatabaseServices.AssocArrayPolarParameters.GetFillAngle(System.String&amp;,System.String&amp;)
Wraps the ObjectARX AcDbAssocArrayPolarParameters::fillAngle() method.

Autodesk.AutoCAD.DatabaseServices.AssocArrayPolarParameters.GetStartAngle(System.String&amp;,System.String&amp;)
Wraps the ObjectARX AcDbAssocArrayPolarParameters::startAngle() method.

Autodesk.AutoCAD.DatabaseServices.AssocArrayPolarParameters.GetRadius(System.String&amp;,System.String&amp;)
Wraps the ObjectARX AcDbAssocArrayPolarParameters::radius() method.